#### Terraform Plan
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.ct_config.ignition will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "ignition" {
      + content      = (known after apply)
      + files_dir    = "./.."
      + id           = (known after apply)
      + pretty_print = false
      + rendered     = (known after apply)
      + strict       = true
    }

  # null_resource.regenerate_key must be replaced
-/+ resource "null_resource" "regenerate_key" {
      ~ id       = "2100941616944623062" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "ignition_config_hash"  = "44fcbbde1316f9ae21cfd7151c30b014a94759d5b05ed497f94c27ae74d19f9d" -> "4630c6d7e44afda79516669888ca11e4e10f0fbd6fa371eae3c47acbb00b30fa"
            # (11 unchanged elements hidden)
        }
    }

  # oci_core_instance.this will be created
  + resource "oci_core_instance" "this" {
      + availability_domain                 = "xykJ:UK-LONDON-1-AD-3"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.compartment.oc1..aaaaaaaafuvd3pcfan7vltla4vfklid2z55au5dasf4r5kkxykif3gzfyxaa"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = {
          + "terraform.managed" = "terraform"
          + "terraform.name"    = "oci-apps"
          + "terraform.repo"    = "https://github.com/batinicaz/oci-apps"
        }
      + display_name                        = "oci-apps"
      + extended_metadata                   = (known after apply)
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_ai_enterprise_enabled            = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = true
      + launch_mode                         = (known after apply)
      + metadata                            = (known after apply)
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + security_attributes                 = (known after apply)
      + security_attributes_state           = (known after apply)
      + shape                               = "VM.Standard.A1.Flex"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config (known after apply)

      + availability_config (known after apply)

      + create_vnic_details {
          + assign_ipv6ip          = (known after apply)
          + assign_public_ip       = "false"
          + defined_tags           = (known after apply)
          + display_name           = (known after apply)
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + nsg_ids                = [
              + "ocid1.networksecuritygroup.oc1.uk-london-1.aaaaaaaauumjy6yshwstfkxi3tcgbm564cmmctrcieggrv65fsmmaxflaxuq",
            ]
          + private_ip             = (known after apply)
          + security_attributes    = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_cidr            = (known after apply)
          + subnet_id              = "ocid1.subnet.oc1.uk-london-1.aaaaaaaaocb6yhiygivj4tq5yfhsyyyefivkbtmd3vtiaws5mlhu5ni2bcvq"
          + vlan_id                = (known after apply)

          + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      + instance_options {
          + are_legacy_imds_endpoints_disabled = true
        }

      + launch_options {
          + boot_volume_type                    = (known after apply)
          + firmware                            = (known after apply)
          + is_consistent_volume_naming_enabled = (known after apply)
          + is_pv_encryption_in_transit_enabled = true
          + network_type                        = "PARAVIRTUALIZED"
          + remote_data_volume_type             = (known after apply)
        }

      + launch_volume_attachments (known after apply)

      + licensing_configs (known after apply)

      + placement_constraint_details (known after apply)

      + platform_config (known after apply)

      + preemptible_instance_config (known after apply)

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 24
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 4
          + processor_description         = (known after apply)
          + resource_management           = (known after apply)
          + vcpus                         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = "50"
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.uk-london-1.aaaaaaaaze7uoavoo7lblhkq4rzfclpwrrfoubqvqiprstvqtpvi4j4ymfka"
          + source_type             = "image"

          + instance_source_image_filter_details (known after apply)
        }
    }

  # oci_core_volume_attachment.data will be created
  + resource "oci_core_volume_attachment" "data" {
      + attachment_type                     = "paravirtualized"
      + availability_domain                 = (known after apply)
      + chap_secret                         = (known after apply)
      + chap_username                       = (known after apply)
      + compartment_id                      = (known after apply)
      + device                              = (known after apply)
      + display_name                        = (known after apply)
      + encryption_in_transit_type          = (known after apply)
      + id                                  = (known after apply)
      + instance_id                         = (known after apply)
      + ipv4                                = (known after apply)
      + ipv6                                = (known after apply)
      + iqn                                 = (known after apply)
      + is_agent_auto_iscsi_login_enabled   = (known after apply)
      + is_multipath                        = (known after apply)
      + is_pv_encryption_in_transit_enabled = true
      + is_read_only                        = (known after apply)
      + is_shareable                        = (known after apply)
      + is_volume_created_during_launch     = (known after apply)
      + iscsi_login_state                   = (known after apply)
      + multipath_devices                   = (known after apply)
      + port                                = (known after apply)
      + state                               = (known after apply)
      + time_created                        = (known after apply)
      + use_chap                            = (known after apply)
      + volume_id                           = "ocid1.volume.oc1.uk-london-1.abwgiljt4ct3mbde36hzogytsscuz4rzr657jbwkltnnc5c7j2b4tbuidbgq"
    }

  # oci_identity_dynamic_group.this will be updated in-place
  ~ resource "oci_identity_dynamic_group" "this" {
        id             = "ocid1.dynamicgroup.oc1..aaaaaaaaxep7ntfhuk7cuhcgnmyvgjag2fhhbxoefyveb4kdz2npzrsypusq"
      ~ matching_rule  = "instance.id = 'ocid1.instance.oc1.uk-london-1.anwgiljtwlhza7acqjwq2ujvnkqj7gyttrpu3dd5vgsp4nl3yauxsrkve2fa'" -> (known after apply)
        name           = "oci-apps"
        # (6 unchanged attributes hidden)
    }

  # oci_load_balancer_backend.traefik will be created
  + resource "oci_load_balancer_backend" "traefik" {
      + backendset_name  = "traefik"
      + backup           = false
      + drain            = (known after apply)
      + id               = (known after apply)
      + ip_address       = (known after apply)
      + load_balancer_id = "ocid1.loadbalancer.oc1.uk-london-1.aaaaaaaakgjfvnm67avsld5nuuabjxago6nwzr6ssogd5b65zgxdcwvx7xxa"
      + max_connections  = (known after apply)
      + name             = (known after apply)
      + offline          = (known after apply)
      + port             = 80
      + state            = (known after apply)
      + weight           = (known after apply)
    }

  # tailscale_tailnet_key.this will be replaced due to changes in replace_triggered_by
-/+ resource "tailscale_tailnet_key" "this" {
      ~ created_at    = "2026-02-21T18:08:54Z" -> (known after apply)
      ~ expires_at    = "2026-02-21T18:18:54Z" -> (known after apply)
      ~ id            = "kFUpyPmBEx11CNTRL" -> (known after apply)
      ~ invalid       = false -> (known after apply)
      ~ key           = (sensitive value)
        tags          = [
            "tag:oci",
        ]
      + user_id       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 2 to destroy.

```